{
    "apply_residual_connection_post_layernorm": false,
    "attention_dropout": 0.0,
    "attention_softmax_in_fp32": true,
    "architectures": [
        "BloomForCausalLM"
    ],
    "bias_dropout_fusion": true,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "pad_token_id": 3,
    "unk_token_id": 0,
    "hidden_dropout": 0.0,
    "initializer_range": 0.02,
    "layer_norm_epsilon": 1e-05,
    "masked_softmax_fusion": true,
    "model_type": "bloom",
    "n_embed": 2048,
    "n_inner": null,
    "n_layer": 1,
    "num_attention_heads": 16,
    "offset_alibi": 100,
    "pretraining_tp": 2,
    "seq_length": 4096,
    "skip_bias_add": true,
    "skip_bias_add_qkv": false,
    "transformers_version": "4.20.0",
    "use_cache": true,
    "vocab_size": 250880
}