{
    "apply_residual_connection_post_layernorm": false,
    "architectures": [
      "BloomForCausalLM"
    ],
    "attention_dropout": 0.0,
    "attention_softmax_in_fp32": true,
    "bias_dropout_fusion": true,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "hidden_dropout": 0.0,
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "layer_norm_epsilon": 1e-05,
    "masked_softmax_fusion": true,
    "model_type": "bloom",
    "n_head": 32,
    "n_inner": null,
    "n_layer": 2,
    "offset_alibi": 100,
    "pad_token_id": 3,
    "pretraining_tp": 1,
    "skip_bias_add": true,
    "skip_bias_add_qkv": false,
    "slow_but_exact": false,
    "torch_dtype": "float16",
    "transformers_version": null,
    "unk_token_id": 0,
    "use_cache": true,
    "vocab_size": 250880
  }
