{
    "_name_or_path": "openai/whisper-large-v2",
    "activation_dropout": 0.0,
    "activation_function": "gelu",
    "architectures": [
        "WhisperForConditionalGeneration"
    ],
    "attention_dropout": 0.0,
    "begin_suppress_tokens": [
        220,
        50257
    ],
    "bos_token_id": 50257,
    "d_model": 1280,
    "decoder_attention_heads": 20,
    "decoder_ffn_dim": 5120,
    "decoder_layerdrop": 0.0,
    "decoder_layers": 1,
    "decoder_start_token_id": 50258,
    "dropout": 0.0,
    "encoder_attention_heads": 20,
    "encoder_ffn_dim": 5120,
    "encoder_layerdrop": 0.0,
    "encoder_layers": 1,
    "eos_token_id": 50257,
    "forced_decoder_ids": [
        [
            1,
            50259
        ],
        [
            2,
            50359
        ],
        [
            3,
            50363
        ]
    ],
    "init_std": 0.02,
    "is_encoder_decoder": true,
    "max_length": 448,
    "max_source_positions": 1500,
    "max_target_positions": 448,
    "model_type": "whisper",
    "num_hidden_layers": 1,
    "num_mel_bins": 80,
    "pad_token_id": 50257,
    "scale_embedding": false,
    "suppress_tokens": [
        1,
        2,
        7,
        8,
        9,
        10,
        14,
        25,
        26,
        27,
        28,
        29,
        31,
        58,
        59,
        60,
        61,
        62,
        63,
        90,
        91,
        92,
        93,
        359,
        503,
        522,
        542,
        873,
        893,
        902,
        918,
        922,
        931,
        1350,
        1853,
        1982,
        2460,
        2627,
        3246,
        3253,
        3268,
        3536,
        3846,
        3961,
        4183,
        4667,
        6585,
        6647,
        7273,
        9061,
        9383,
        10428,
        10929,
        11938,
        12033,
        12331,
        12562,
        13793,
        14157,
        14635,
        15265,
        15618,
        16553,
        16604,
        18362,
        18956,
        20075,
        21675,
        22520,
        26130,
        26161,
        26435,
        28279,
        29464,
        31650,
        32302,
        32470,
        36865,
        42863,
        47425,
        49870,
        50254,
        50258,
        50358,
        50359,
        50360,
        50361,
        50362
    ],
    "torch_dtype": "float32",
    "transformers_version": "4.27.0.dev0",
    "use_cache": true,
    "vocab_size": 51865
}