{
    "architectures": [
        "MllamaForConditionalGeneration"
    ],
    "image_token_index": 128256,
    "model_type": "mllama",
    "text_config": {
        "_name_or_path": "",
        "add_cross_attention": false,
        "architectures": null,
        "bad_words_ids": null,
        "begin_suppress_tokens": null,
        "bos_token_id": 128000,
        "chunk_size_feed_forward": 0,
        "cross_attention_hidden_size": null,
        "cross_attention_layers": [
            3,
            8,
            13,
            18,
            23,
            28,
            33,
            38
        ],
        "decoder_start_token_id": null,
        "diversity_penalty": 0.0,
        "do_sample": false,
        "dropout": 0,
        "early_stopping": false,
        "encoder_no_repeat_ngram_size": 0,
        "eos_token_id": [
            128001,
            128008,
            128009
        ],
        "exponential_decay_length_penalty": null,
        "finetuning_task": null,
        "forced_bos_token_id": null,
        "forced_eos_token_id": null,
        "hidden_act": "silu",
        "hidden_size": 4096,
        "id2label": {
            "0": "LABEL_0",
            "1": "LABEL_1"
        },
        "initializer_range": 0.02,
        "intermediate_size": 14336,
        "is_decoder": false,
        "is_encoder_decoder": false,
        "label2id": {
            "LABEL_0": 0,
            "LABEL_1": 1
        },
        "length_penalty": 1.0,
        "max_length": 20,
        "max_position_embeddings": 131072,
        "min_length": 0,
        "model_type": "mllama_text_model",
        "no_repeat_ngram_size": 0,
        "num_attention_heads": 32,
        "num_beam_groups": 1,
        "num_beams": 1,
        "num_hidden_layers": 40,
        "num_key_value_heads": 8,
        "num_return_sequences": 1,
        "output_attentions": false,
        "output_hidden_states": false,
        "output_scores": false,
        "pad_token_id": 128004,
        "prefix": null,
        "problem_type": null,
        "pruned_heads": {},
        "remove_invalid_values": false,
        "repetition_penalty": 1.0,
        "return_dict": true,
        "return_dict_in_generate": false,
        "rms_norm_eps": 1e-05,
        "rope_scaling": {
            "factor": 8.0,
            "high_freq_factor": 4.0,
            "low_freq_factor": 1.0,
            "original_max_position_embeddings": 8192,
            "rope_type": "llama3"
        },
        "rope_theta": 500000.0,
        "sep_token_id": null,
        "suppress_tokens": null,
        "task_specific_params": null,
        "temperature": 1.0,
        "tf_legacy_loss": false,
        "tie_encoder_decoder": false,
        "tie_word_embeddings": false,
        "tokenizer_class": null,
        "top_k": 50,
        "top_p": 1.0,
        "torch_dtype": "bfloat16",
        "torchscript": false,
        "typical_p": 1.0,
        "use_bfloat16": false,
        "use_cache": true,
        "vocab_size": 128256
    },
    "torch_dtype": "bfloat16",
    "transformers_version": "4.45.0.dev0",
    "vision_config": {
        "_name_or_path": "",
        "add_cross_attention": false,
        "architectures": null,
        "attention_heads": 16,
        "bad_words_ids": null,
        "begin_suppress_tokens": null,
        "bos_token_id": null,
        "chunk_size_feed_forward": 0,
        "cross_attention_hidden_size": null,
        "decoder_start_token_id": null,
        "diversity_penalty": 0.0,
        "do_sample": false,
        "early_stopping": false,
        "encoder_no_repeat_ngram_size": 0,
        "eos_token_id": null,
        "exponential_decay_length_penalty": null,
        "finetuning_task": null,
        "forced_bos_token_id": null,
        "forced_eos_token_id": null,
        "hidden_act": "gelu",
        "hidden_size": 1280,
        "id2label": {
            "0": "LABEL_0",
            "1": "LABEL_1"
        },
        "image_size": 560,
        "intermediate_layers_indices": [
            3,
            7,
            15,
            23,
            30
        ],
        "intermediate_size": 5120,
        "is_decoder": false,
        "is_encoder_decoder": false,
        "label2id": {
            "LABEL_0": 0,
            "LABEL_1": 1
        },
        "length_penalty": 1.0,
        "max_length": 20,
        "max_num_tiles": 4,
        "min_length": 0,
        "model_type": "mllama_vision_model",
        "no_repeat_ngram_size": 0,
        "norm_eps": 1e-05,
        "num_beam_groups": 1,
        "num_beams": 1,
        "num_channels": 3,
        "num_global_layers": 8,
        "num_hidden_layers": 32,
        "num_return_sequences": 1,
        "output_attentions": false,
        "output_hidden_states": false,
        "output_scores": false,
        "pad_token_id": null,
        "patch_size": 14,
        "prefix": null,
        "problem_type": null,
        "pruned_heads": {},
        "remove_invalid_values": false,
        "repetition_penalty": 1.0,
        "return_dict": true,
        "return_dict_in_generate": false,
        "sep_token_id": null,
        "supported_aspect_ratios": [
            [
                1,
                1
            ],
            [
                1,
                2
            ],
            [
                1,
                3
            ],
            [
                1,
                4
            ],
            [
                2,
                1
            ],
            [
                2,
                2
            ],
            [
                3,
                1
            ],
            [
                4,
                1
            ]
        ],
        "suppress_tokens": null,
        "task_specific_params": null,
        "temperature": 1.0,
        "tf_legacy_loss": false,
        "tie_encoder_decoder": false,
        "tie_word_embeddings": true,
        "tokenizer_class": null,
        "top_k": 50,
        "top_p": 1.0,
        "torch_dtype": "bfloat16",
        "torchscript": false,
        "typical_p": 1.0,
        "use_bfloat16": false,
        "vision_output_dim": 7680
    }
}