{
	"architectures": [
		"GPTNeoXForCausalLM"
	],
	"attention_probs_dropout_prob": 0,
	"bos_token_id": 0,
	"eos_token_id": 0,
	"hidden_act": "gelu_fast",
	"hidden_dropout_prob": 0,
	"hidden_size": 2048,
	"initializer_range": 0.02,
	"intermediate_size": 24576,
	"layer_norm_eps": 1e-05,
	"max_position_embeddings": 2048,
	"model_type": "gpt_neox",
	"num_attention_heads": 16,
	"num_hidden_layers": 1,
	"rotary_emb_base": 10000,
	"rotary_pct": 0.25,
	"tie_word_embeddings": false,
	"torch_dtype": "float16",
	"transformers_version": "4.19.0.dev0",
	"use_cache": true,
	"vocab_size": 50432
}