{
    "architectures": [
        "StableLMEpochForCausalLM"
    ],
    "auto_map": {
        "AutoConfig": "configuration_stablelm_epoch.StableLMEpochConfig",
        "AutoModelForCausalLM": "modeling_stablelm_epoch.StableLMEpochForCausalLM"
    },
    "bos_token_id": 100257,
    "eos_token_id": 100257,
    "hidden_act": "silu",
    "hidden_size": 2048,
    "initializer_range": 0.02,
    "intermediate_size": 5632,
    "max_position_embeddings": 4096,
    "model_type": "stablelm_epoch",
    "norm_eps": 1e-05,
    "num_attention_heads": 32,
    "num_heads": 32,
    "num_hidden_layers": 1,
    "num_key_value_heads": 32,
    "rope_pct": 0.25,
    "rope_theta": 10000,
    "rotary_scaling_factor": 1.0,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.36.2",
    "use_cache": true,
    "use_qkv_bias": true,
    "vocab_size": 100352
}